Revit 2027 API
Form.BaseOffset Property
Retrieve/set the base offset of the form object. It is only valid for locked form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BaseOffset { get; set; }
Public Property BaseOffset As Double
	Get
	Set
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
member BaseOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException | Thrown when this is not a locked form.
ArgumentException | Thrown when the value is invalid.
ApplicationException | Thrown when it fail to get/set BaseOffset.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace